# -*- coding: utf-8 -*-
"""
Created on Fri May 29 14:33:44 2020

@author: User
"""
import pymysql

INSERT_POLITICIAN_DATA="""insert into tb_politician_info values(%s, %s, %s, %s, %s, %s, %s, %s,
%s, %s, %s, %s, %s, %s, %s, %s ,%s, %s, %s ,%s,%s,%s )"""
conn=pymysql.connect(host='localhost',user='root',password='algoalgo'
                                      ,db='project_algo',charset='utf8')

with conn.cursor() as curs:
    curs.execute(INSERT_POLITICIAN_DATA,(100120253,"김성태",20160413,2,"강서구을","서울특별시",
                                         "강서구","새누리당",1,"19580523",57,"서울특별시 강서구 양천로55길",
                                         72,"국회의원",221,"한양대학교 행정대학원 석사 졸업","(전)새누리당 서울시당 위원장",
                                         "(현)국회 예산결산특별위원회 새누리당 간사",45861,45,1,100))
    curs.execute(INSERT_POLITICIAN_DATA,(100119674,"한정애",20160413,2,"강서구병","서울특별시",
                                         "강서구","더불어민주당",2,"19650108",51,"서울특별시 강서구 화곡로",
                                         72,"국회의원",221,"영국 노팅엄대학교 대학원 산업공학박사 졸업","(현)제19대 국회의원",
                                         "(현)더불어민주당 원내부대표",39992,43,1,0))
    curs.execute(INSERT_POLITICIAN_DATA,(100119904,"이인영",20160413,2,"구로구갑","서울특별시",
                                         "구로구","더불어민주당",1,"19640628",51,"서울특별시 구로구 고척로",
                                         72,"국회의원",221,"고려대학교 언론대학원 졸업(언론학 석사)","(전)민주당 최고의원",
                                         "(현)19대 국회의원",64063,52,1,100))
    curs.execute(INSERT_POLITICIAN_DATA,(100120032,"박영선",20160413,2,"구로구을","서울특별시",
                                         "구로구","더불어민주당",2,"19600122",56,"서울특별시 구로구 신도림로19길",
                                         72,"국회의원",221,"서강대학교 언론대학원 졸(문학석사)","(전) 새정치민주연합 원내대표",
                                         "(전) 국회 법제사법위원장",50523,54,1,0))
    curs.execute(INSERT_POLITICIAN_DATA,(100119649,"이훈",20160413,2,"금천구","서울특별시",
                                         "금천구","더불어민주당",1,"19650906",50,"서울특별시 금천구 시흥대로47길",
                                         75,"정당인",68,"서강대학교 사학과 졸업","(전)김대중정부 청와대 국정상황실장",
                                         "(전)노무현정부 비서관",42635,38,1,100))
    

conn.commit()
conn.close()